zephyrproject-rtos/hal_nuvoton/m55m1x/Devices/M55M1/Include/hsusbd_reg.h
#define HSUSBD_GINTEN_EPIIEN_Pos         (10)                                              /*!< HSUSBD_T::GINTEN: EPIIEN Position      */
#define HSUSBD_GINTEN_EPIIEN_Msk         (0x1ul << HSUSBD_GINTEN_EPIIEN_Pos)               /*!< HSUSBD_T::GINTEN: EPIIEN Mask          */

#define HSUSBD_GINTEN_EPJIEN_Pos         (11)                                              /*!< HSUSBD_T::GINTEN: EPJIEN Position      */
#define HSUSBD_GINTEN_EPJIEN_Msk         (0x1ul << HSUSBD_GINTEN_EPJIEN_Pos)               /*!< HSUSBD_T::GINTEN: EPJIEN Mask          */

#define HSUSBD_GINTEN_EPKIEN_Pos         (12)                                              /*!< HSUSBD_T::GINTEN: EPKIEN Position      */
#define HSUSBD_GINTEN_EPKIEN_Msk         (0x1ul << HSUSBD_GINTEN_EPKIEN_Pos)               /*!< HSUSBD_T::GINTEN: EPKIEN Mask          */

#define HSUSBD_GINTEN_EPLIEN_Pos         (13)                                              /*!< HSUSBD_T::GINTEN: EPLIEN Position      */
#define HSUSBD_GINTEN_EPLIEN_Msk         (0x1ul << HSUSBD_GINTEN_EPLIEN_Pos)               /*!< HSUSBD_T::GINTEN: EPLIEN Mask          */

#define HSUSBD_GINTEN_EPMIEN_Pos         (14)                                              /*!< HSUSBD_T::GINTEN: EPMIEN Position      */
#define HSUSBD_GINTEN_EPMIEN_Msk         (0x1ul << HSUSBD_GINTEN_EPMIEN_Pos)               /*!< HSUSBD_T::GINTEN: EPMIEN Mask          */

#define HSUSBD_GINTEN_EPNIEN_Pos         (15)                                              /*!< HSUSBD_T::GINTEN: EPNIEN Position      */
#define HSUSBD_GINTEN_EPNIEN_Msk         (0x1ul << HSUSBD_GINTEN_EPNIEN_Pos)               /*!< HSUSBD_T::GINTEN: EPNIEN Mask          */

#define HSUSBD_GINTEN_EPOIEN_Pos         (16)                                              /*!< HSUSBD_T::GINTEN: EPOIEN Position      */
#define HSUSBD_GINTEN_EPOIEN_Msk         (0x1ul << HSUSBD_GINTEN_EPOIEN_Pos)               /*!< HSUSBD_T::GINTEN: EPOIEN Mask          */

#define HSUSBD_GINTEN_EPPIEN_Pos         (17)                                              /*!< HSUSBD_T::GINTEN: EPPIEN Position      */
#define HSUSBD_GINTEN_EPPIEN_Msk         (0x1ul << HSUSBD_GINTEN_EPPIEN_Pos)               /*!< HSUSBD_T::GINTEN: EPPIEN Mask          */

#define HSUSBD_GINTEN_EPQIEN_Pos         (18)                                              /*!< HSUSBD_T::GINTEN: EPQIEN Position      */
#define HSUSBD_GINTEN_EPQIEN_Msk         (0x1ul << HSUSBD_GINTEN_EPQIEN_Pos)               /*!< HSUSBD_T::GINTEN: EPQIEN Mask          */

#define HSUSBD_GINTEN_EPRIEN_Pos         (19)                                              /*!< HSUSBD_T::GINTEN: EPRIEN Position      */
#define HSUSBD_GINTEN_EPRIEN_Msk         (0x1ul << HSUSBD_GINTEN_EPRIEN_Pos)               /*!< HSUSBD_T::GINTEN: EPRIEN Mask          */

#define HSUSBD_BUSINTSTS_SOFIF_Pos       (0)                                               /*!< HSUSBD_T::BUSINTSTS: SOFIF Position    */
#define HSUSBD_BUSINTSTS_SOFIF_Msk       (0x1ul << HSUSBD_BUSINTSTS_SOFIF_Pos)             /*!< HSUSBD_T::BUSINTSTS: SOFIF Mask        */

#define HSUSBD_BUSINTSTS_RSTIF_Pos       (1)                                               /*!< HSUSBD_T::BUSINTSTS: RSTIF Position    */
#define HSUSBD_BUSINTSTS_RSTIF_Msk       (0x1ul << HSUSBD_BUSINTSTS_RSTIF_Pos)             /*!< HSUSBD_T::BUSINTSTS: RSTIF Mask        */

#define HSUSBD_BUSINTSTS_RESUMEIF_Pos    (2)                                               /*!< HSUSBD_T::BUSINTSTS: RESUMEIF Position */
#define HSUSBD_BUSINTSTS_RESUMEIF_Msk    (0x1ul << HSUSBD_BUSINTSTS_RESUMEIF_Pos)          /*!< HSUSBD_T::BUSINTSTS: RESUMEIF Mask     */

#define HSUSBD_BUSINTSTS_SUSPENDIF_Pos   (3)                                               /*!< HSUSBD_T::BUSINTSTS: SUSPENDIF Position*/
#define HSUSBD_BUSINTSTS_SUSPENDIF_Msk   (0x1ul << HSUSBD_BUSINTSTS_SUSPENDIF_Pos)         /*!< HSUSBD_T::BUSINTSTS: SUSPENDIF Mask    */

#define HSUSBD_BUSINTSTS_HISPDIF_Pos     (4)                                               /*!< HSUSBD_T::BUSINTSTS: HISPDIF Position  */
#define HSUSBD_BUSINTSTS_HISPDIF_Msk     (0x1ul << HSUSBD_BUSINTSTS_HISPDIF_Pos)           /*!< HSUSBD_T::BUSINTSTS: HISPDIF Mask      */

#define HSUSBD_BUSINTSTS_DMADONEIF_Pos   (5)                                               /*!< HSUSBD_T::BUSINTSTS: DMADONEIF Position*/
#define HSUSBD_BUSINTSTS_DMADONEIF_Msk   (0x1ul << HSUSBD_BUSINTSTS_DMADONEIF_Pos)         /*!< HSUSBD_T::BUSINTSTS: DMADONEIF Mask    */

#define HSUSBD_BUSINTSTS_PHYCLKVLDIF_Pos (6)                                               /*!< HSUSBD_T::BUSINTSTS: PHYCLKVLDIF Position*/
#define HSUSBD_BUSINTSTS_PHYCLKVLDIF_Msk (0x1ul << HSUSBD_BUSINTSTS_PHYCLKVLDIF_Pos)       /*!< HSUSBD_T::BUSINTSTS: PHYCLKVLDIF Mask  */

#define HSUSBD_BUSINTSTS_VBUSDETIF_Pos   (8)                                               /*!< HSUSBD_T::BUSINTSTS: VBUSDETIF Position*/
#define HSUSBD_BUSINTSTS_VBUSDETIF_Msk   (0x1ul << HSUSBD_BUSINTSTS_VBUSDETIF_Pos)         /*!< HSUSBD_T::BUSINTSTS: VBUSDETIF Mask    */

#define HSUSBD_BUSINTSTS_LPMTKNIF_Pos    (9)                                               /*!< HSUSBD_T::BUSINTSTS: LPMTKNIF Position */
#define HSUSBD_BUSINTSTS_LPMTKNIF_Msk    (0x1ul << HSUSBD_BUSINTSTS_LPMTKNIF_Pos)          /*!< HSUSBD_T::BUSINTSTS: LPMTKNIF Mask     */

#define HSUSBD_BUSINTEN_SOFIEN_Pos       (0)                                               /*!< HSUSBD_T::BUSINTEN: SOFIEN Position    */
#define HSUSBD_BUSINTEN_SOFIEN_Msk       (0x1ul << HSUSBD_BUSINTEN_SOFIEN_Pos)             /*!< HSUSBD_T::BUSINTEN: SOFIEN Mask        */

#define HSUSBD_BUSINTEN_RSTIEN_Pos       (1)                                               /*!< HSUSBD_T::BUSINTEN: RSTIEN Position    */
#define HSUSBD_BUSINTEN_RSTIEN_Msk       (0x1ul << HSUSBD_BUSINTEN_RSTIEN_Pos)             /*!< HSUSBD_T::BUSINTEN: RSTIEN Mask        */

#define HSUSBD_BUSINTEN_RESUMEIEN_Pos    (2)                                               /*!< HSUSBD_T::BUSINTEN: RESUMEIEN Position */
#define HSUSBD_BUSINTEN_RESUMEIEN_Msk    (0x1ul << HSUSBD_BUSINTEN_RESUMEIEN_Pos)          /*!< HSUSBD_T::BUSINTEN: RESUMEIEN Mask     */

