zephyrproject-rtos/hal_nuvoton/m55m1x/Devices/M55M1/Include/hsusbd_reg.h
#define HSUSBD_EPRSPCTL_SHORTTXEN_Pos    (6)                                               /*!< HSUSBD_T::EPRSPCTL: SHORTTXEN Position */
#define HSUSBD_EPRSPCTL_SHORTTXEN_Msk    (0x1ul << HSUSBD_EPRSPCTL_SHORTTXEN_Pos)          /*!< HSUSBD_T::EPRSPCTL: SHORTTXEN Mask     */

#define HSUSBD_EPRSPCTL_DISBUF_Pos       (7)                                               /*!< HSUSBD_T::EPRSPCTL: DISBUF Position    */
#define HSUSBD_EPRSPCTL_DISBUF_Msk       (0x1ul << HSUSBD_EPRSPCTL_DISBUF_Pos)             /*!< HSUSBD_T::EPRSPCTL: DISBUF Mask        */

#define HSUSBD_EPMPS_EPMPS_Pos           (0)                                               /*!< HSUSBD_T::EPMPS: EPMPS Position        */
#define HSUSBD_EPMPS_EPMPS_Msk           (0x7fful << HSUSBD_EPMPS_EPMPS_Pos)               /*!< HSUSBD_T::EPMPS: EPMPS Mask            */

#define HSUSBD_EPTXCNT_TXCNT_Pos         (0)                                               /*!< HSUSBD_T::EPTXCNT: TXCNT Position      */
#define HSUSBD_EPTXCNT_TXCNT_Msk         (0x7fful << HSUSBD_EPTXCNT_TXCNT_Pos)             /*!< HSUSBD_T::EPTXCNT: TXCNT Mask          */

#define HSUSBD_EPCFG_EPEN_Pos            (0)                                               /*!< HSUSBD_T::EPCFG: EPEN Position         */
#define HSUSBD_EPCFG_EPEN_Msk            (0x1ul << HSUSBD_EPCFG_EPEN_Pos)                  /*!< HSUSBD_T::EPCFG: EPEN Mask             */

#define HSUSBD_EPCFG_EPTYPE_Pos          (1)                                               /*!< HSUSBD_T::EPCFG: EPTYPE Position       */
#define HSUSBD_EPCFG_EPTYPE_Msk          (0x3ul << HSUSBD_EPCFG_EPTYPE_Pos)                /*!< HSUSBD_T::EPCFG: EPTYPE Mask           */

#define HSUSBD_EPCFG_EPDIR_Pos           (3)                                               /*!< HSUSBD_T::EPCFG: EPDIR Position        */
#define HSUSBD_EPCFG_EPDIR_Msk           (0x1ul << HSUSBD_EPCFG_EPDIR_Pos)                 /*!< HSUSBD_T::EPCFG: EPDIR Mask            */

#define HSUSBD_EPCFG_EPNUM_Pos           (4)                                               /*!< HSUSBD_T::EPCFG: EPNUM Position        */
#define HSUSBD_EPCFG_EPNUM_Msk           (0xful << HSUSBD_EPCFG_EPNUM_Pos)                 /*!< HSUSBD_T::EPCFG: EPNUM Mask            */

#define HSUSBD_EPBUFSTART_SADDR_Pos      (0)                                               /*!< HSUSBD_T::EPBUFST: SADDR Position      */
#define HSUSBD_EPBUFSTART_SADDR_Msk      (0xffful << HSUSBD_EPBUFST_SADDR_Pos)             /*!< HSUSBD_T::EPBUFST: SADDR Mask          */

#define HSUSBD_EPBUFEND_EADDR_Pos        (0)                                               /*!< HSUSBD_T::EPBUFEND: EADDR Position     */
#define HSUSBD_EPBUFEND_EADDR_Msk        (0xffful << HSUSBD_EPBUFEND_EADDR_Pos)            /*!< HSUSBD_T::EPBUFEND: EADDR Mask         */

#define HSUSBD_BCDC_BCDEN_Pos            (0)                                               /*!< HSUSBD_T::BCDC: BCDEN Position         */
#define HSUSBD_BCDC_BCDEN_Msk            (0x1ul << HSUSBD_BCDC_BCDEN_Pos)                  /*!< HSUSBD_T::BCDC: BCDEN Mask             */

#define HSUSBD_BCDC_DETMOD_Pos           (1)                                               /*!< HSUSBD_T::BCDC: DETMOD Position        */
#define HSUSBD_BCDC_DETMOD_Msk           (0x7ul << HSUSBD_BCDC_DETMOD_Pos)                 /*!< HSUSBD_T::BCDC: DETMOD Mask            */

#define HSUSBD_BCDC_DETSTS_Pos           (4)                                               /*!< HSUSBD_T::BCDC: DETSTS Position        */
#define HSUSBD_BCDC_DETSTS_Msk           (0x1ul << HSUSBD_BCDC_DETSTS_Pos)                 /*!< HSUSBD_T::BCDC: DETSTS Mask            */

#define HSUSBD_BCDC_USP_Pos              (5)                                               /*!< HSUSBD_T::BCDC: USP Position           */
#define HSUSBD_BCDC_USP_Msk              (0x1ul << HSUSBD_BCDC_USP_Pos)                    /*!< HSUSBD_T::BCDC: USP Mask               */

#define HSUSBD_BCDC_BCDIEN_Pos           (30)                                              /*!< HSUSBD_T::BCDC: BCDIEN Position        */
#define HSUSBD_BCDC_BCDIEN_Msk           (0x1ul << HSUSBD_BCDC_BCDIEN_Pos)                 /*!< HSUSBD_T::BCDC: BCDIEN Mask            */

#define HSUSBD_BCDC_BCDIF_Pos            (31)                                              /*!< HSUSBD_T::BCDC: BCDIF Position         */
#define HSUSBD_BCDC_BCDIF_Msk            (0x1ul << HSUSBD_BCDC_BCDIF_Pos)                  /*!< HSUSBD_T::BCDC: BCDIF Mask             */

#define HSUSBD_LPMCSR_bmAttributes_Pos   (0)                                               /*!< HSUSBD_T::LPMCSR: bmAttributes Position*/
#define HSUSBD_LPMCSR_bmAttributes_Msk   (0x7fful << HSUSBD_LPMCSR_bmAttributes_Pos)       /*!< HSUSBD_T::LPMCSR: bmAttributes Mask    */

#define HSUSBD_LPMCSR_LPMEN_Pos          (12)                                              /*!< HSUSBD_T::LPMCSR: LPMEN Position       */
#define HSUSBD_LPMCSR_LPMEN_Msk          (0x1ul << HSUSBD_LPMCSR_LPMEN_Pos)                /*!< HSUSBD_T::LPMCSR: LPMEN Mask           */

#define HSUSBD_LPMCSR_LPMSLEEPEN_Pos     (13)                                              /*!< HSUSBD_T::LPMCSR: LPMSLEEPEN Position  */
#define HSUSBD_LPMCSR_LPMSLEEPEN_Msk     (0x1ul << HSUSBD_LPMCSR_LPMSLEEPEN_Pos)           /*!< HSUSBD_T::LPMCSR: LPMSLEEPEN Mask      */

#define HSUSBD_LPMCSR_LPMSENDNYET_Pos    (14)                                              /*!< HSUSBD_T::LPMCSR: LPMSENDNYET Position */
#define HSUSBD_LPMCSR_LPMSENDNYET_Msk    (0x1ul << HSUSBD_LPMCSR_LPMSENDNYET_Pos)          /*!< HSUSBD_T::LPMCSR: LPMSENDNYET Mask     */

#define HSUSBD_DMAADDR_DMAADDR_Pos       (0)                                               /*!< HSUSBD_T::DMAADDR: DMAADDR Position    */
#define HSUSBD_DMAADDR_DMAADDR_Msk       (0xfffffffful << HSUSBD_DMAADDR_DMAADDR_Pos)      /*!< HSUSBD_T::DMAADDR: DMAADDR Mask        */

#define HSUSBD_PHYCTL_DPPUEN_Pos         (8)                                               /*!< HSUSBD_T::PHYCTL: DPPUEN Position      */
#define HSUSBD_PHYCTL_DPPUEN_Msk         (0x1ul << HSUSBD_PHYCTL_DPPUEN_Pos)               /*!< HSUSBD_T::PHYCTL: DPPUEN Mask          */

#define HSUSBD_PHYCTL_PHYEN_Pos          (9)                                               /*!< HSUSBD_T::PHYCTL: PHYEN Position       */
#define HSUSBD_PHYCTL_PHYEN_Msk          (0x1ul << HSUSBD_PHYCTL_PHYEN_Pos)                /*!< HSUSBD_T::PHYCTL: PHYEN Mask           */

