zephyrproject-rtos/hal_nuvoton/m55m1x/Devices/M55M1/Include/hsusbd_reg.h
#define HSUSBD_PHYCTL_VBUSWKEN_Pos       (24)                                              /*!< HSUSBD_T::PHYCTL: VBUSWKEN Position    */
#define HSUSBD_PHYCTL_VBUSWKEN_Msk       (0x1ul << HSUSBD_PHYCTL_VBUSWKEN_Pos)             /*!< HSUSBD_T::PHYCTL: VBUSWKEN Mask        */

#define HSUSBD_PHYCTL_LINESTATEWKEN_Pos  (25)                                              /*!< HSUSBD_T::PHYCTL: LINESTATEWKEN Position*/
#define HSUSBD_PHYCTL_LINESTATEWKEN_Msk  (0x1ul << HSUSBD_PHYCTL_LINESTATEWKEN_Pos)        /*!< HSUSBD_T::PHYCTL: LINESTATEWKEN Mask   */

#define HSUSBD_PHYCTL_STALLREVERT_Pos    (26)                                              /*!< HSUSBD_T::PHYCTL: STALLREVERT Position */
#define HSUSBD_PHYCTL_STALLREVERT_Msk    (0x1ul << HSUSBD_PHYCTL_STALLREVERT_Pos)          /*!< HSUSBD_T::PHYCTL: STALLREVERT Mask     */

#define HSUSBD_PHYCTL_PHYCLKSTB_Pos      (27)                                              /*!< HSUSBD_T::PHYCTL: PHYCLKSTB Position   */
#define HSUSBD_PHYCTL_PHYCLKSTB_Msk      (0x1ul << HSUSBD_PHYCTL_PHYCLKSTB_Pos)            /*!< HSUSBD_T::PHYCTL: PHYCLKSTB Mask       */

#define HSUSBD_PHYCTL_VBUSDET_Pos        (31)                                              /*!< HSUSBD_T::PHYCTL: VBUSDET Position     */
#define HSUSBD_PHYCTL_VBUSDET_Msk        (0x1ul << HSUSBD_PHYCTL_VBUSDET_Pos)              /*!< HSUSBD_T::PHYCTL: VBUSDET Mask         */

/** @} HSUSBD_CONST */
/** @} end of HSUSBD register group */
/** @} end of REGISTER group */

#if defined ( __CC_ARM   )
    #pragma no_anon_unions
#endif

#endif /* __HSUSBD_REG_H__ */
